using Calculator;
namespace Program;
public class Program
{
     static void Main(string[] args)
        {
                      
        }
}
public class Primer
    {
        
    }

//1. Напишите программу замена элементов массива: положительные элементы замените на соответствующие отрицательные, и наоборот.

//[-4, -8, 8, 2] -> [4, 8, -8, -2]

//2. Задайте массив. Напишите программу, которая определяет, присутствует ли заданное число в массиве.

// массив [6, 7, 19, 345, 3] -> нет

// массив [6, 7, 19, 345, 3] -> да

//Размер массива от 5 до 10

//Числа в массива от -20 до 20
